甲輪牌箱=['紅心2', '梅花3', '方塊3', '黑桃9', '紅心9', '方塊9', '梅花9']
一對張數= 2
#######################就像時針分針
def 甲輪抓牌(甲輪的收集, 甲輪第幾抽):

	if 甲輪第幾抽 == len(甲輪牌箱):
		 if len(甲輪的收集) == 一對張數:
		 	if(甲輪的收集[0][-1:]==甲輪的收集[1][-1:]):
		 	
		 		剩下那些=排除元素(甲輪牌箱, 甲輪的收集)
		 		甲輪抓到的數字=甲輪的收集[0][-1:]
		 		# print("甲輪抓到的數字 "+ 甲輪抓到的數字, end='')
		 		乙輪抓牌(剩下那些, 甲輪的收集, 0) # 再抓一輪
		 return # 上帝指示

	甲輪抓牌(甲輪的收集, 甲輪第幾抽+1) # 問抓不抓? 不抓
	拷貝那份=甲輪的收集.copy()
	拷貝那份.append(甲輪牌箱[甲輪第幾抽]) # 加進去
	甲輪抓牌(拷貝那份, 甲輪第幾抽+1) # 問抓不抓? 抓
#######################	
def 乙輪抓牌(乙輪牌箱, 甲乙輪的收集, 乙輪第幾抽):
		
	if 乙輪第幾抽 == len(乙輪牌箱):
		 if len(甲乙輪的收集) == 一對張數+一對張數:
		 	if(甲乙輪的收集[2][-1:]==甲乙輪的收集[3][-1:] and 甲乙輪的收集[2][-1:]!=甲乙輪的收集[0][-1:]):
		 		
		 		剩下那些=排除元素(甲輪牌箱, 甲乙輪的收集)
		 		for 單張牌 in 剩下那些:
		 			if(單張牌[-1:]!=甲乙輪的收集[0][-1:] and 單張牌[-1:]!=甲乙輪的收集[3][-1:]):
		 				print("抓2Pair="+ str(甲乙輪的收集)+" 搭 "+單張牌)
		 return # 上帝指示

	乙輪抓牌(乙輪牌箱, 甲乙輪的收集, 乙輪第幾抽+1) # 問抓不抓? 不抓		
	拷貝那份=甲乙輪的收集.copy()
	拷貝那份.append(乙輪牌箱[乙輪第幾抽]) # 加進去
	乙輪抓牌(乙輪牌箱, 拷貝那份, 乙輪第幾抽+1) # 問抓不抓? 抓
#######################
def 排除元素(原容器, 該排除的元素):
	新容器 = []
	for 元素 in 原容器:
		if 元素 not in 該排除的元素:
			新容器.append(元素)
	return 新容器
#######################
甲輪抓牌([], 0) # 開始抓牌
#輸出:
# 抓2Pair=['梅花3', '方塊3', '黑桃9', '梅花9'] 搭 紅心2
# 抓2Pair=['梅花3', '方塊3', '黑桃9', '方塊9'] 搭 紅心2
# 抓2Pair=['梅花3', '方塊3', '黑桃9', '紅心9'] 搭 紅心2
