牌箱=['紅心1', '黑桃2', '紅心2', '梅花3', '方塊8', '黑桃9', '紅心9', '方塊9', '梅花9']
四條張數= 4
牌箱深度=len(牌箱)

def 抓鐵支(手上的牌, 第幾抽):

	if 第幾抽 == 牌箱深度:
		if len(手上的牌) == 四條張數:
		 	暫存牌箱=[]
		 	for 單張牌 in 手上的牌: 暫存牌箱.append(int(單張牌[-1:]))
		 	if 暫存牌箱[0]==暫存牌箱[1]==暫存牌箱[2]==暫存牌箱[3]:
		 		for 單張牌 in 牌箱: 
		 			if int(單張牌[-1:]) != 暫存牌箱[0]: print("抓鐵支="+ str(手上的牌)+" 搭 "+單張牌)
		return # 上帝指示

	抓鐵支(手上的牌, 第幾抽+1) # 不掀開即為不抓
	
	掀開的牌=牌箱[第幾抽]
	拷貝那份=手上的牌.copy()
	拷貝那份.append(掀開的牌) # 加進手上的牌
	手上的牌=拷貝那份
	抓鐵支(手上的牌, 第幾抽+1)
#######################
抓鐵支([], 0)

# 輸出:
# 抓鐵支=['黑桃9', '紅心9', '方塊9', '梅花9'] 搭 紅心1
# 抓鐵支=['黑桃9', '紅心9', '方塊9', '梅花9'] 搭 黑桃2
# 抓鐵支=['黑桃9', '紅心9', '方塊9', '梅花9'] 搭 紅心2
# 抓鐵支=['黑桃9', '紅心9', '方塊9', '梅花9'] 搭 梅花3
# 抓鐵支=['黑桃9', '紅心9', '方塊9', '梅花9'] 搭 方塊8
