甲輪牌箱=['紅心1', '黑桃2', '紅心2', '梅花3', '方塊8', '黑桃9', '紅心9', '方塊9', '梅花9']
三條張數= 3 # 設定甲輪抓幾張
一對張數= 2 # 設定乙輪抓幾張
#######################就像時針分針
def 甲輪抓牌(甲輪的收集, 甲輪第幾層):

	if 甲輪第幾層 == len(甲輪牌箱):
		 if len(甲輪的收集) == 三條張數:
		 	if(甲輪的收集[0][-1:]==甲輪的收集[1][-1:]==甲輪的收集[2][-1:]):
		 		
		 		print("抓葫蘆 "+ str(甲輪的收集))
		 		剩下那些=排除元素(甲輪牌箱, 甲輪的收集)
		 		乙輪抓牌(剩下那些, [], 0) # 再抓一輪
		 		
		 return # 上帝指示

	甲輪抓牌(甲輪的收集, 甲輪第幾層+1) # 問抓不抓? 不抓
	拷貝那份=甲輪的收集.copy()
	拷貝那份.append(甲輪牌箱[甲輪第幾層]) # 加進去
	甲輪抓牌(拷貝那份, 甲輪第幾層+1) # 問抓不抓? 抓
#######################	
def 乙輪抓牌(乙輪牌箱, 乙輪的收集, 乙輪第幾層):
		
	if 乙輪第幾層 == len(乙輪牌箱):
		 if len(乙輪的收集) == 一對張數:
		 	if(乙輪的收集[0][-1:]==乙輪的收集[1][-1:]):
		 		
		 		print(' 搭配 ' + str(乙輪的收集))
		 
		 return # 上帝指示

	乙輪抓牌(乙輪牌箱, 乙輪的收集, 乙輪第幾層+1) # 問抓不抓? 不抓		
	拷貝那份=乙輪的收集.copy()
	拷貝那份.append(乙輪牌箱[乙輪第幾層]) # 加進去
	乙輪抓牌(乙輪牌箱, 拷貝那份, 乙輪第幾層+1) # 問抓不抓? 抓
#######################
def 排除元素(原容器, 該排除的元素):
	新容器 = []
	for 元素 in 原容器:
		if 元素 not in 該排除的元素:
			新容器.append(元素)
	return 新容器
#######################
甲輪抓牌([], 0) # 開始抓牌
#輸出:
# 抓葫蘆 ['紅心9', '方塊9', '梅花9'] ['黑桃2', '紅心2']
# 抓葫蘆 ['黑桃9', '方塊9', '梅花9'] ['黑桃2', '紅心2']
