寶箱=['愛','愛','愛', '完','不','完']
回傳容器=cache=[]
baseLen=len(寶箱)

def 排列(曾經擁有):
		global cache
		if len(曾經擁有) == baseLen:
			if 曾經擁有 != cache:
				cache=曾經擁有 # print('曾經擁有='+str(曾經擁有))
				回傳容器.append(曾經擁有)
			return # 上帝指示

		新歡=排除元素(寶箱, 曾經擁有)

		while len(新歡)!=0:
			拷貝那份=曾經擁有.copy()
			拷貝那份.append(新歡.pop(0)) 
			排列(拷貝那份)
#########################
def 排除元素(原容器, 該排除的元素):
	新容器 = 原容器.copy()
	for 元素 in 該排除的元素:
		新容器.remove(元素)
	return 新容器
#########################
def 加工輸出(容器):
	容器.sort()
	cache=[]
	cnt=0
	size=len(容器)
	for idx in range(0, size):
		if (容器[idx]!=cache):
			cache=容器[idx]
			cnt+=1
			if cnt%11==1:
				print(str(cnt)+'='+str(容器[idx]))
	print( '總樣態數='+str(cnt))
#######################
# 寶箱.sort()
排列([])
print( '寶箱='+str(寶箱)+' 排列後 len='+str(len(回傳容器)))
加工輸出(回傳容器)
#輸出:
# 1=['不', '完', '完', '愛', '愛', '愛']
# 11=['完', '不', '完', '愛', '愛', '愛']
# 21=['完', '愛', '不', '愛', '愛', '完']
# 31=['愛', '不', '完', '完', '愛', '愛']
# 41=['愛', '完', '完', '愛', '不', '愛']
# 51=['愛', '愛', '不', '愛', '完', '完']
# 總樣態數=60