牌箱=['紅心1', '黑桃2', '紅心2', '梅花3', '方塊3', '黑桃9', '紅心9', '方塊9', '梅花9']
三條張數= 3 # 設定甲輪抓幾張
一對張數= 2 # 設定乙輪抓幾張

已抓三條的數字='0'
#######################甲乙輪就像時針分針
def 甲輪抓牌(甲輪的收集, 甲輪第幾抽):
	
	if 甲輪第幾抽 == len(牌箱):
		 if len(甲輪的收集) == 三條張數:
		 	if 甲輪的收集[0][-1:]==甲輪的收集[1][-1:]==甲輪的收集[2][-1:]:
		 		global 已抓三條的數字
		 		已抓三條的數字=甲輪的收集[0][-1:]
		 		乙輪抓牌(甲輪的收集, 0) # 再抓 1 輪
		 return # 上帝指示

	甲輪抓牌(甲輪的收集, 甲輪第幾抽+1) # 問抓不抓? 不抓
	拷貝那份=甲輪的收集.copy()
	拷貝那份.append(牌箱[甲輪第幾抽]) # 加進去
	甲輪抓牌(拷貝那份, 甲輪第幾抽+1) # 問抓不抓? 抓
#######################	
def 乙輪抓牌(甲乙輪的收集, 乙輪第幾抽):
 
	if 乙輪第幾抽 == len(牌箱):
		if len(甲乙輪的收集) == 三條張數+一對張數:
		 	if 甲乙輪的收集[3][-1:]==甲乙輪的收集[4][-1:]: print("抓葫蘆=", 甲乙輪的收集)
		return # 上帝指示
	
	乙輪抓牌(甲乙輪的收集, 乙輪第幾抽+1) # 問抓不抓? 不抓		

	掀開的牌=牌箱[乙輪第幾抽] # print("掀開的牌="+str(掀開的牌)+"已抓三條的數字")
	if 掀開的牌[-1:] != 已抓三條的數字: # 檢查三條跟一對的數字不重複
		拷貝那份=甲乙輪的收集.copy()
		拷貝那份.append(掀開的牌) # 加進去
		乙輪抓牌(拷貝那份, 乙輪第幾抽+1) # 問抓不抓? 抓
#######################
甲輪抓牌([], 0) # 開始抓牌

# 輸出:
# 抓葫蘆= ['紅心9', '方塊9', '梅花9', '梅花8', '方塊8']
# 抓葫蘆= ['紅心9', '方塊9', '梅花9', '黑桃2', '紅心2']
# 抓葫蘆= ['黑桃9', '方塊9', '梅花9', '梅花8', '方塊8']
# 抓葫蘆= ['黑桃9', '方塊9', '梅花9', '黑桃2', '紅心2']
# 抓葫蘆= ['黑桃9', '紅心9', '梅花9', '梅花8', '方塊8']
# 抓葫蘆= ['黑桃9', '紅心9', '梅花9', '黑桃2', '紅心2']
# 抓葫蘆= ['黑桃9', '紅心9', '方塊9', '梅花8', '方塊8']
# 抓葫蘆= ['黑桃9', '紅心9', '方塊9', '黑桃2', '紅心2']
